app/views/comments/index.html.erb

</div>
<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 2)