app/views/posts/index.html.erb

							<p><%= post.body %></p>
							<p class="links"><%= link_to "Read More", post %>  &nbsp;&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;&nbsp;<%= link_to 'Comments', post_comments_path(:post_id => post.id, :post => post, :method => :get) %> (<%= post.comments.count %>)</p>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `comments` WHERE (`comments`.post_id = 1)) AS subquery
SELECT `posts`.* FROM `posts`