app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    if  @post.comments.create!(params[:comment])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 3) LIMIT 1
INSERT INTO `comments` (`comment`, `commentor`, `created_at`, `post_id`, `updated_at`) VALUES ('Very true', 'User22', '2011-07-29 08:26:39', 3, '2011-07-29 08:26:39')

def index
@post = Post.find(params[:post_id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 2) LIMIT 1

def destroy
	@post = Post.find(params[:post_id])
	@comment = @post.comments.find(params[:id])
	@comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 1) AND (`comments`.`id` = 1) LIMIT 1
DELETE FROM `comments` WHERE (`comments`.`id` = 1)