app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1

  def new
    @tags = Tag.all
---
SELECT `tags`.* FROM `tags`

  def create
    @post = Post.new(params[:post])
    @post.post_by=current_user.email

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`body`, `created_at`, `post_by`, `title`, `updated_at`) VALUES ('$ git push heroku master\r\n! No such app as cold-snow-542\r\nfatal: The remote end hung up unexpectedly\r\n\r\n\r\nThis error comes up when current application is till was being deployed to \'cold-snow-542\', and later this \'cold-show-542\' has been deleted from our Heroku account. To deal with such problem\r\n\r\n$ git remote -v\r\nheroku git@heroku.com:cold-snow-542.git\r\norigin git@github.com:Username/applicationname.git\r\n\r\n$ git remote rm heroku\r\n\r\nThe above command will remove previous application association due to which problem is arising.\r\n\r\n$ git remote add heroku git@heroku.com:new-heroku-application-name-95.git\r\n\r\n$ git push heroku master\r\n\r\nThis time application will successfuly get pushed into Heroku. ', '2011-07-29 09:01:01', 'pvrohini@yahoo.com', 'git push heroku master ! No such app', '2011-07-29 09:01:01')